# поскольку нужна только одна функция из библиотеки RANDOM, импортируем только ее
# и для удобства называем коротким именем Ch
from random import choice as Ch


GENDER = ['M', 'F']

# списки мужских и женских имен (сортировал отдельно при помощи функции 'sorted')

NAMES = ['Аарне',  'Авраам',  'Айбу', 'Акбай', 'Александр', 'Алексей', 'Андрей',
         'Антипа', 'Бадма', 'Бату', 'Бимбии', 'Бобоо', 'Бурбээ', 'Вавила', 
         'Вадим', 'Важа', 'Вали', 'Василий', 'Василько', 'Виктор', 'Вилли', 'Вилье', 
         'Виталий', 'Владимир', 'Вячеслав', 'Гамзат', 'Геннадий', 'Гоча', 'Григоре',
         'Дакко', 'Данил', 'Дмитрий', 'Джон', 'Евгений', 'Егор', 'Жорж', 'Захар',
         'Захария', 'Иван', 'Игорь', 'Илмари', 'Илья', 'Иса', 'Исе', 'Камиль', 'Кий',
         'Константин', 'Лев', 'Леонид', 'Люций', 'Максим', 'Марк', 'Марий', 'Матвей',
         'Менея', 'Мина', 'Минай', 'Михаил', 'Михайло', 'Никий', 'Никита', 'Никифор',
         'Николай', 'Олег', 'Отто', 'Петр', 'Пётр', 'Прохор', 'Роман', 'Серафим',
         'Сергей', 'Сидор', 'Стахий', 'Степан', 'Тимофей', 'Тихон', 'Трофим',
         'Федор', 'Франц', 'Харитон', 'Хуан', 'Цезарь', 'Эдуард', 'Юлий', 'Яков', 'Януш']

NAMES_F = ['Александра', 'Алёна', 'Анастасия', 'Анна', 'Виктория', 'Галина',
           'Дарья', 'Екатерина', 'Елена', 'Жанна', 'Зинаида', 'Инна', 'Ксения',
           'Любовь', 'Марина', 'Мария', 'Надежда', 'Наталья', 'Наталия', 'Нина',
           'Ольга', 'Просковья', 'Светлана', 'Серафима', 'Тамара', 'Татьяна',
           'Ульяна', 'Яна']

# окончания отчеств и фиамилий 

FNAMES_SFX = ['ович','евич'] 
FNAMES_SFX_F = ['овна', 'евна']

FAMILY_NAME = ['ов', 'ев']
FAMILY_NAME_F = ['ова', 'ева']

# список имен-исключений, где отчества и фамилии формируются не по правилам 
EXNAMES = ['Айбу', 'Бадма', 'Бату', 'Бимбии', 'Бобоо', 'Бурбээ', 
           'Вали', 'Дакко', 'Дмитрий', 'Захария', 'Илья', 'Иса', 'Исе', 'Кий', 'Лев', 
           'Люций', 'Менея', 'Мина', 'Минай', 'Никий', 'Никита', 'Пётр',
           'Савва', 'Сила', 'Стахий', 'Фока', 'Яков']

EXFNAMES = ['Айбуевич', 'Бадмаевич', 'Бутуевич', 'Бимбииевич', 'Бобооевич', 
            'Бурбээевич', 'Валиевич', 'Даккоевич', 'Дмитриевич',
            'Захариевич', 'Ильич', 'Исаевич', 'Исеевич', 'Киевич', 'Львович',
            'Люциевич', 'Менеевич', 'Минич', 'Минаевич',  'Никиевич',
            'Никитич', 'Петрович', 'Саввич', 'Силич', 'Стахиевич', 'Фокич', 
            'Яковлевич']

EXFFAMILY_NAMES = ['Айбуев', 'Бадмаев', 'Бутуев(Батуев)', 'Бимбииев', 'Бобооев', 
            'Бурбээев', 'Валиев', 'Даккоев', 'Дмитриев',
            'Захариев', 'Ильин', 'Исаев', 'Исеев', 'Киев', 'Львов',  'Люциев',
            'Менеев', 'Миниев(Минев)', 'Минаев', 'Никиев', 'Никитин', 
            'Петров', 'Саввин', 'Силин', 'Стахиевин', 'Фокин', 'Яковлев']

EXFNAMES_F = ['Айбуевна', 'Бадмаевна', 'Бутуевна', 'Бимбииевна', 'Бобооевна', 
            'Бурбээевна',  'Валиевна', 'Даккоевна', 'Дмитриевна',
            'Захариевна', 'Ильинична', 'Исаевна', 'Исеевна', 'Киевна', 'Львовна', 'Люциевна',
            'Менеевна', 'Минична', 'Минаевна', 'Никиевна', 'Никитична', 
            'Петровна', 'Саввична', 'Силична', 'Стахиевна', 'Фокична', 'Яковлевна']

EXFFAMILY_NAMES_F = ['Айбуева', 'Бадмаева', 'Бутуева(Батуева)', 'Бимбииева', 'Бобооева', 
            'Бурбээева', 'Валиева', 'Даккоева', 'Дмитриева',
            'Захариева', 'Ильина', 'Исаева', 'Исеева', 'Киева', 'Львова',  'Люциева',
            'Менеева', 'Миниева(Минева)', 'Минаева', 'Никиева', 'Никитина', 
            'Петрова', 'Саввина', 'Силина', 'Стахиевина', 'Фокина', 'Яковлева']

#   Правила формирования отчеств взяты с сайта:
#  'https://zags.admin-smolensk.ru/poleznaya-informaciya/obrazovanie-otchestv/'

people = []    #инициализируем список ФИО, который после наполнения будет выводиться в конце на печать

for i in range(10):
    
    gender = Ch(GENDER)
    
    s = ""
    
    if gender == 'M':
        name = Ch(NAMES)
        
        s += " " + name + " "    # добавляем имя
        
        name = Ch(NAMES)

 # блок формирования мужских отчеств (по идее надо вывести в отдельную функцию)
        if name in EXNAMES:     # сразу проверяем имена-исключения
            fname = EXFNAMES[EXNAMES.index(name)]
        elif name [-1] in ('йь') and name [-2:] != 'ий':    # Для 'ий' следующий elif
            fname = name[:-1] + FNAMES_SFX[1]
        elif name [-2:] in ('ий'):
            fname = name[:-2] + 'ь' + FNAMES_SFX[1]
        elif name [-1] in ('жшчщц'):
            fname = name + FNAMES_SFX[1]
        elif name [-2:] in ('жа', 'ша', 'ча', 'ща', 'ца'):
            fname = name[:-1] + FNAMES_SFX[1]
        elif name [-1] in ('ауы'):
            fname = name[:-1] + FNAMES_SFX[0]
        elif name [-1] in ('е'):
            fname = name[:-1] + FNAMES_SFX[1]
        elif name [-1] in ('и'):
            fname = name + FNAMES_SFX[1]
        elif name [-1] in ('о'):
            fname = name[:-1] + FNAMES_SFX[0] 
        else:
            fname = name + FNAMES_SFX[0]
   
        s += fname     # добавляем в конец отчество
        
        name = Ch(NAMES)
        
        # блок формирования мужских фамилий
       
        if name in EXNAMES:     # сразу проверяем имена-исключения
            fname = EXFFAMILY_NAMES[EXNAMES.index(name)]
        elif name [-1] in ('йь') and name [-2:] != 'ий':    # Для 'ий' следующий elif
            fname = name[:-1] + FAMILY_NAME[1]
        elif name [-2:] in ('ий'):
            fname = name[:-2] + 'ь' + FAMILY_NAME[1]
        elif name [-1] in ('жшчщц'):
            fname = name + FAMILY_NAME[1]
        elif name [-2:] in ('жа', 'ша', 'ча', 'ща', 'ца'):
            fname = name[:-1] + FAMILY_NAME[1]
        elif name [-1] in ('ауы'):
            fname = name[:-1] + FAMILY_NAME[0]
        elif name [-1] in ('е'):
            fname = name[:-1] + FAMILY_NAME[1]
        elif name [-1] in ('и'):
            fname = name + FAMILY_NAME[1]
        elif name [-1] in ('о'):
            fname = name[:-1] + FAMILY_NAME[0] 
        else:
            fname = name + FAMILY_NAME[0]
        
        s = fname + s    # ставим в начало фамилию
        
    else:
        name = Ch(NAMES_F)
        
        s += " " + name + " "    # добавляем имя
        
        name = Ch(NAMES)   # отчества и фамилии формируются из мужских имен

# блок формирования женских отчеств (по идее надо вывести в отдельную функцию)

    
        if name in EXNAMES:     # сразу проверяем имена-исключения
            fname = EXFNAMES_F[EXNAMES.index(name)]
        elif name [-1] in ('йь') and name [-2:] != 'ий':    # Для 'ий' следующий elif
            fname = name[:-1] + FNAMES_SFX_F[1]
        elif name [-2:] in ('ий'):
            fname = name[:-2] + 'ь' + FNAMES_SFX_F[1]
        elif name [-1] in ('жшчщц'):
            fname = name + FNAMES_SFX_F[1]
        elif name [-2:] in ('жа', 'ша', 'ча', 'ща', 'ца'):
            fname = name[:-1] + FNAMES_SFX_F[1]
        elif name [-1] in ('ауы'):
            fname = name[:-1] + FNAMES_SFX_F[0]
        elif name [-1] in ('е'):
            fname = name[:-1] + FNAMES_SFX_F[1]
        elif name [-1] in ('и'):
            fname = name + FNAMES_SFX_F[1]
        elif name [-1] in ('о'):
            fname = name[:-1] + FNAMES_SFX_F[0] 
        else:
            fname = name + FNAMES_SFX_F[0]
        
        s += fname     # добавляем в конец отчество  
    
        name = Ch(NAMES)
# блок формирования женских фамилий

        if name in EXNAMES:     # сразу проверяем имена-исключения
            fname = EXFFAMILY_NAMES_F[EXNAMES.index(name)]
        elif name [-1] in ('йь') and name [-2:] != 'ий':    # Для 'ий' следующий elif
            fname = name[:-1] + FAMILY_NAME_F[1]
        elif name [-2:] in ('ий'):
            fname = name[:-2] + 'ь' + FAMILY_NAME_F[1]
        elif name [-1] in ('жшчщц'):
            fname = name + FAMILY_NAME_F[1]
        elif name [-2:] in ('жа', 'ша', 'ча', 'ща', 'ца'):
            fname = name[:-1] + FAMILY_NAME_F[1]
        elif name [-1] in ('ауы'):
            fname = name[:-1] + FAMILY_NAME_F[0]
        elif name [-1] in ('е'):
            fname = name[:-1] + FAMILY_NAME_F[1]
        elif name [-1] in ('и'):
            fname = name + FAMILY_NAME_F[1]
        elif name [-1] in ('о'):
            fname = name[:-1] + FAMILY_NAME_F[0] 
        else:
            fname = name + FAMILY_NAME_F[0]

        s = fname + s    # ставим в начало фамилию   
    people.append(s)    #добавляем строку в список
    
print(*people, sep='\n')